[
  {
    "title": "Global Brands Group – Internship",
    "description": [
      "Explored digital transformation strategies and their applications across industries",
      "Gained in-depth knowledge of Office 365 tools for productivity and collaboration",
      "Developed skills in leveraging Microsoft Power Platform for automation and data insights.",
      "Mastered the use of SharePoint for online collaboration and content management."
    ],
    "image_url": "assets/experience/Global-Group.webp",
    "data": "18-10-2023",
    "link": "https://drive.google.com/file/d/1QNdrEf43tpf9Vz6fjgANGkbtzgWOfcBE/view?usp=drivesdk"
  },
  {
    "title": "Next Academy – InternShip",
    "description": [
      "Gained hands-on experience in developing mobile applications using the Flutter framework.",
      "Built foundational knowledge in creating cross-platform apps for both Android and iOS",
      "Integrated Firebase for real-time database operations and user authentication."
    ],
    "image_url": "assets/experience/next-academy-logo.png",
    "data": "27-8-2023",
    "link": "https://drive.google.com/file/d/1StOtcEPFDzeoDneDUr3kdE3_MOpnGy60/view?usp=drivesdk"
  },
  {
    "title": "NVIDIA – Workshop",
    "description": [
      "Participated in a workshop on AI and deep learning technologies",
      "Gained insights into NVIDIA’s latest advancements in GPU computing",
      "Learned about the applications of AI in various industries, including healthcare and automotive",
      "Explored the use of NVIDIA tools for developing AI models and applications."
    ],
    "image_url": "assets/experience/nvidia-logo-16.png",
    "data": "10-8-2022",
    "link": "https://drive.google.com/file/d/14uCzWm34jcoRFzJ3iPzyJl8NW0Jaho9H/view?usp=drivesdk"
  },
  {
    "title": "PathLine – InternShip",
    "description": [
      "Completed a Web Development Level III internship at PathLine Training Academy with a focus on Angular framework.",
      "Developed a fully responsive personal portfolio website using Angular,showcasing skills,projects,and experience ",
      "Gained practical experience in Angular CLI, TypeScript, and modular design principles. "
    ],
    "image_url": "assets/experience/pathline.png",
    "data": "4-2025",
    "link": "https://drive.google.com/file/d/1NBttaQYKrq72_VRF1NL0gda7TrZ1SSEX/view?usp=drivesdk"
  },
  {
    "title": "Angular Course – Udemy ",
    "description": [
      "successfully completed the course Angular - The Complete Guide (2025 Edition).",
      "A hands-on deep dive into Angular’s core concepts including components, routing, forms, and services.",
      "Learned best practices for building scalable and maintainable Angular applications.",
      "Explored advanced topics such as state management, lazy loading, and performance optimization."
    ],
    "image_url": "assets/experience/Angular-cert.jpg",
    "data": "23-4-2025",
    "link": "https://drive.google.com/file/d/1pJYG4FEuGndaelFo0MOjy-0dNnsigdFf/view?usp=drive_link"
  },
  {
    "title": "Angular Certification – HackerRank",
    "description": [
      "Earned two certifications from HackerRank: Angular (Basic) and Angular (Intermediate).",
      "Demonstrated solid understanding of Angular fundamentals including components, data binding, and directives.",
      "Applied advanced concepts such as dependency injection, routing, observables, and reactive forms.",
      "Validated skills in building efficient, scalable, and maintainable Angular applications."
    ],
    "image_url": "assets/experience/hacker-cert2.png",
    "data": "4-5-2025",
    "link": "https://www.hackerrank.com/certificates/iframe/62f36a6856e7"
  }
]
